//3. Создайте класс Seasons, в экземпляре которого должно быть перечисление времен года, реализованное с помощью типа enum.
//Определите метод SeasonsChange, при вызове которого будет меняться время года.Определите метод возвращающий какое время года в данный момент.
//Создать класс ReverseSeason, наследующий от класса Seasons, в котором переопределить метод SeasonsChange так, чтобы перечисление времен года,
//шло в обратном порядке. Протестируйте работу классов.

#include <iostream>
using namespace std;

class Seasons
{
public:
    static enum; /////////////////////////////////

    Seasons()
    {
        ;
    }

    void SeasonsChange()
    {
        ;
    }
};

class ReverseSeason : public Seasons
{
    ReverseSeason()
    {
        ;
    }

    void SeasonsChange()
    {
        ;
    }
};

int main()
{
    cout << "Hello World!\n";

    return 0;
}