//Создать структуру, которая хранит имя человека и его номер телефона. Создать очередь из 5-ти структур и вывести результат.
//Помним, что в очереди кто первым записался, тот первым и обслуживается.

#include <iostream>
using namespace std;

struct human {
    string name;
    string phone;
};

int main()
{
    setlocale(LC_ALL, "RUS");

    human queue[5];
    queue[0] = {"Вася", "+7(111)111-11-11"};
    queue[1] = {"Петя", "+7(222)222-22-22"};
    queue[2] = {"Коля", "+7(333)333-33-33"};
    queue[3] = {"Маша", "+7(444)444-44-44"};
    queue[4] = {"Нюша", "+7(555)555-55-55"};

    for (int i = 0; i < 5; i++)
        cout << queue[i].name << ", " << queue[i].phone << endl;
}