//Вывести на экран таблицу квадратов чисел от 10 до 20.

#include <iostream>
using namespace std;

int main()
{
	for (int i = 10; i <= 20; i++)
	{
		cout << i * i << endl;
	}
	cin.get();
	return 0;
}