Repository: Sergey74ua/ChildrenTraining
Catalog: PHP/pets-nursery/languages/pets-nursery-*.po
Languages: ru_ru

source: Litters
ru_ru: Выводки

source: Litter
ru_ru: Выводок

source: Add Litter
ru_ru: Добавить выводок

source: Add New Litter
ru_ru: Добавить новый выводок

source: Edit Litter
ru_ru: Редактировать выводок

source: New Litter
ru_ru: Новый выводок

source: View Litter
ru_ru: Просмотреть выводок

source: Search Litters
ru_ru: Поиск выводков

source: No litters found
ru_ru: Выводков не найдено

source: No litters found in Trash
ru_ru: В корзине выводков не найдено

source: Litter Information
ru_ru: Информация о выводке

source: Litter birth date:
ru_ru: Дата рождения выводка:

source: This date will automatically become the birth date of all pets in the litter
ru_ru: Эта дата автоматически станет датой рождения всех питомцев в выводке

source: Father:
ru_ru: Отец:

source: -- Select father --
ru_ru: -- Выберите отца --

source: Mother:
ru_ru: Мать:

source: -- Select mother --
ru_ru: -- Выберите мать --

source: Pets in litter:
ru_ru: Питомцы в выводке:

source: Search pet by nickname...
ru_ru: Поиск питомца по кличке...

source: Search
ru_ru: Найти

source: Or create new pet:
ru_ru: Или создайте нового питомца:

source: New pet nickname
ru_ru: Кличка нового питомца

source: Create Pet
ru_ru: Создать питомца

source: Pets
ru_ru: Питомцы

source: Pet
ru_ru: Питомец

source: Add Pet
ru_ru: Добавить питомца

source: Add New Pet
ru_ru: Добавить нового питомца

source: Edit Pet
ru_ru: Редактировать питомца

source: New Pet
ru_ru: Новый питомец

source: View Pet
ru_ru: Просмотреть питомца

source: Search Pets
ru_ru: Поиск питомцев

source: No pets found
ru_ru: Питомцев не найдено

source: No pets found in Trash
ru_ru: В корзине питомцев не найдено

source: Pet Information
ru_ru: Информация о питомце

source: Nickname:
ru_ru: Кличка:

source: Nickname automatically becomes the pet title. You can change the title above.
ru_ru: Кличка автоматически становится заголовком питомца. Вы можете изменить заголовок выше.

source: Birth date:
ru_ru: Дата рождения:

source: If pet is linked to a litter, birth date is automatically taken from the litter
ru_ru: Если питомец привязан к выводку, дата рождения автоматически берется из выводка

source: Litter:
ru_ru: Выводок:

source: -- Select litter --
ru_ru: -- Выберите выводок --

source: Pets not found
ru_ru: Питомцы не найдены

source: Nickname cannot be empty
ru_ru: Кличка не может быть пустой

source: Error creating pet
ru_ru: Ошибка при создании питомца

source: Parents:
ru_ru: Родители:
