#Вариант 1


CREATE TABLE `school` (
  `subject` CHAR(32) PRIMARY KEY,
  `grade` INT,
  `teacher` CHAR(64)
);

INSERT `school` (`subject`, `grade`, `teacher`) VALUES
  ('Математика', 5, 'Иванова М.И.'),
  ('Физика', 4, 'Петрова Н.И'),
  ('Химия', 3, 'Сидорова А.Н.'),
  ('Информатика', 5, 'Кузнецов В.И.'),
  ('Русский язык', 4, 'Столярова В.И.'),
  ('Русская литература', 3, 'Плотникова А.С.'),
  ('Английский язык', 5, 'Кукушкина И.В.'),
  ('История', 4, 'Соколов В.В.'),
  ('Биология', 3, 'Орлова Н.И.'),
  ('Физкультура', 5, 'Воробьев А.С.');

SELECT `subject` FROM `school`
  WHERE `grade` = 5
  ORDER BY `grade`;