# Урок № 8 по Python - строки

x = 123454321
x = str(x)
print("конвертация в строку -", x)
print("повторение строки -", x*5)
print("сравнение строк abc > x -", "abc" > "x")
print("сравнение строк a > B -", "a" > "B")
print("поиск позиции символа в строке -", x.find("4")) # index - вылетает при отсутствии символа
print("поиск позиции в подстроке -", x.find("4", 4, 6))
print("поиск позиции с конца -", x.rfind("4"))
print("замена символа -", x.replace("4", "f"))
print("замена символа в подстроке -", x.replace("4", "", 1))
print("подсчет совпадений -", x.count("4"))
print("подсчет совпадений в подстроке -", x.count("4", 1, 5))
print("длина строки -", len(x))
print("проверка строки на число -", x.isdigit())
x = "asasfd"
print("проверка строки на буквы -", x.isalpha())
print()

x = "1 21 125 555 17 0 889"
print(x.ljust(40, "."))
print(x.rjust(40, " "))
print(x)
print("символ № 7 -", x[7])
print("срез от 7 до 12 -", x[7:15])
print("последний символ -1 -", x[-1])
print("последние символы от -1 до -4 -", x[-5:])
print("срез символов с шагом 2", x[::2])
print()

print("конвертация строки в список -", x.split())
x = "1, 21, 125, 555, 17, 0, 88"
x.split(", ") # () - ("") - (",") - (", ")
print("конвертация строки в список с разделителем -", x)
x = ["dh", "gdsrhy", "szeuhseus", "ase4y5354", "awy a 1 2 3 5", "aeyay"]
del x[3]
print("удаление подстроки", x)
x[2] = "Ж"
print("замена подстроки", x)
new_x = "_".join(x)
print("конвертация списка в строку с разделителем -", new_x)
print()

x = "GHL KJH Ll kxj klj"
print("в заглавные -", x.upper())
print("в прописные -", x.lower())
print("С большой буквы -", x.title())

input()